export const pagesReducer = (state, action)=>{
    switch(action.type){
        case "ADD_PAGE":
            return [...state, action.page];
        case "ADD_PAGES":
            return [...state, ...action.pages];
        case "REMOVE_FIRST_PAGES":
            const removeAmount = action.numberOfPagesToRemove;
            const removeFromStart = action.removeFromStart;
            if(removeFromStart){
                const filteredPages = state.slice(removeAmount);
                return filteredPages;
            }
            else{
                const filteredPages = state.slice(0, -removeAmount);
                return filteredPages;
            }
        default:
            return state;
    }
}
export const pagesInitialState = [];
// export const booksInitialState = [
//     {
//         id: "0",
//         title: "רעם אילם",
//         author: "יהודה ניב",
//         prevPrintedPrice: 86.00,
//         printedPrice: 77.90,
//         prevDigitalPrice: 49.9,
//         digitalPrice: 34.50,
//         imgPath: "https://images-evrit.yit.co.il/Images/Products/newcovers/raam_master.jpg",
//         summary: "רעם הוא בחור אילם שמתעורר יום אחד לצד גופתה המדממת של בחורה שהוא מעולם לא ראה, במקום שהוא לא מכיר. הוא מגלה כי תשע שנים חלפו מחייו, אך הוא אינו זוכר דבר ממה שקרה בהן. כשהוא נרדף על ידי עבר אפל ומאיים, רעם האילם נמלט מהחוק ויוצא למסע הרפתקני, קצבי ומותח בעקבות האמת, בעקבות הזיכרון ובעקבות אהבת חייו.\n\nבספרו מספק יהודה ניב הצצה לעולמו של גיבור שנון ובוטה בעל הבנה עמוקה של העולם שמסביב. גישתו המקורית לחיים מעניקה לו דרך להתמודד עם מום שמונע ממנו לדבר אך לא מונע ממנו לחשוב.\n\nרעם אילם הוא פרויקט ייחודי, שבו משלב האמן יהודה ניב את כישרונותיו המגוונים ליצירה אחת. את הספר מלווה אלבום מוזיקלי המבוסס על פרקי הספר ומציג את הסיפור מנקודת מבטה של דמות אפלה המתגלה לאורך העלילה. בספר מופיעים ציורים שאף הם פרי יצירתו של המחבר.",
//         review: "יצירת מופת שתקח את הקורא למחוזות חדשים של אימה מתח וצחוק, מומלץ בכל פה",
//         rating: 5,
//     },
//     {
//         id: "1",
//         title: "מוקף באידיוטים",
//         author: "תומס אריקסון",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.90,
//         prevDigitalPrice: 44.9,
//         digitalPrice: 28.50,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011374400-1635767704318358.jpg",
//         summary: "פגישה עם איש עסקים זועם, שהיה בטוח שכל העובדים שלו אידיוטים, הביאה את חוקר ההתנהגות תומס אריקסון להשקיע שנים במחקר מאומץ, שבמהלכו התברר לו שבני האדם נחלקים לארבעה טיפוסי התנהגות עיקריים:\n\nמוקף באידיוטים מתאר את המאפיינים הבולטים של ארבעת הטיפוסים ואת הדרך הנכונה לתקשר איתם. הוא מסביר כיצד נוכל להתאים את עצמנו לכל טיפוס התנהגות ולהשפיע עליו (או להוציא אותו מדעתו), מספר על שיטות לשיפור שפת הגוף והתקשורת שלנו עם הבוס והעמיתים לעבודה, וגם מדגים איך תזהו מי אתם ותבינו טוב יותר את עצמכם.\n\nתומס אריקסון הוא חוקר התנהגות ומומחה לתקשורת שוודי. לצד עבודתו עם קבוצות מנהלים, והרצאות שהוא נושא בכל רחבי אירופה, פרסם אריקסון ספרים אחדים על תקשורת והתנהגות אנושית. ספרו מוקף באידיוטים תורגם ליותר מעשרים שפות ונמכר בקרוב לשני מיליון עותקים.",
//         review: "לתומס אריקסון יש דרך ייחודית לשחק לקורא במוח באופן שישאיר אותו פעור פה ומשתוקק לעוד",
//         rating: 4,
//     },
//     {
//         id: "2",
//         title: "ארבע ההסכמות",
//         author: "דון מיגל רואיס",
//         prevPrintedPrice: 74.00,
//         printedPrice: 59.20,
//         prevDigitalPrice: 39.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013370973-1714896993267157.jpg",
//         summary: "בחברה הצינית והתועלתנית שלנו כיום כמעט ואין מקום לרוחניות, למרות שכולנו זקוקים לה מאוד.\n\nרוחניות הפכה כמעט להיות כמעט מילה גסה מחוץ לחוגים מאוד מסויימים שלא מתאימים לכולם.\n\nאנחנו כמעט ולא עוסקים ברוחניות בחיי היומיום ובקושי דואגים להזין את הנפש הצמאה שלנו.\n\nדון מיגל רואיס, בן למשפחת מרפאים שמאניים שחווה חווייה חוץ גופית בעקבות תאונה, קורא לנו לאתגר את התפיסות שלנו לגבי העצמי שלנו, הנפש שלנו והקשר שלנו עם היקום המקיף אותנו. בספרו ”ארבע ההסכמות” הוא מנגיש עבורנו את חוכמתו העתיקה של הידע הטולטקי - אורח חיים המצטיין בזמינות גבוהה של אושר ואהבה.\n\nהוא מלמד אותנו על האמונות המגבילות, מהיכן הן נובעות, כיצד הן מייסרות אותנו ומשביתות את השמחה והיצירתיות שבנו, ומנחה אותנו כיצד לנטרל אותן.\n\nהספר פורש בספרו ארבע הסכמות שאנו צריכים שעלינו לעשות עם עצמנו על מנת להתחיל לחיות טוב יותר, לשפר את בריאותנו המנטלית והרוחנית וליצור לעצמנו יציבות בלב עולם סוער.\n\nהתובנות שלו עוסקות בכוחן של המילים, בשחרור מהתחושה שהכול קשור בנו ומלהניח הנחות, ולעשות תמיד את הכי טוב שרק נוכל.\n\nאומר דון מיגל רואיס, ובספר הזה הוא מעניק לנו את הכוח לחלום ומניח בידינו את המפתח להגשמה העצמית וההתפתחות הרוחנית שנזקקנו לה.",
//         review: "לא כל אחד יכול לכתוב יצירה כזאת ולא כל אחד יזכה במהלך חייו לקרוא טקסט כל כך מאלף, חובת קריאה",
//         rating: 5
//     },
//     {
//         id: "3",
//         title: "להתאהב ולהשאר בחיים",
//         author: "שרון צוהר",
//         prevPrintedPrice: 98.00,
//         printedPrice: 59.90,
//         prevDigitalPrice: 35.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/012010275-16753459451015534.jpg",
//         summary: "לא חיפשתי את האביר על הסוס הלבן, לא חיפשתי את הגבר שישנה את כל עולמי. ריבאונד, זה כל מה שזה היה אמור להיות, מישהו שיעזור לי לשכוח, להתקדם הלאה. ואז פגשתי את אלמוג אלבז וכל התוכניות השתנו. חשבתי שאנחנו פועלים לפי חוקים מסוימים, ברורים מאוד, אבל נראה שאלמוג פועל לפי סט חוקים משלו.\n\nכמה אירוני זה לפגוש את אשת חלומותיך בחתונה, ללכת איתה הביתה ולגלות שזו אחותו הקטנה של החבר הכי טוב שלך?\n\nלילה אחד, זה היה הדיל. אף אחת מעולם לא קיבלה יותר מזה, עד שהיא הגיעה. עמדתי מהצד וראיתי את החברים שלי נופלים בזה אחר זה, הבטחתי לעצמי שלעולם לא אאפשר לזה לקרות גם לי, ואז רותי התרסקה לתוך החיים שלי כמו מטאור ואפילו לא ראיתי את זה בא.\n\nלהתאהב ולהישאר בחיים מאת סופרת רבי המכר שרון צוהר הוא סיפור נוסף בסדרת כשהגלים מתחזקים, סיפור אהבה מעולם הצבא ושייטת 13. הספרים שקדמו לו בסדרה: כשהגלים מתחזקים ודואט חמש אצבעות על היעד.",
//         review: "ספר בינוני ביותר, הייתי משאיר אותו על המדף, בעצם הייתי שם אותו כמעצור לדלת או אפילו משתמש בו כחומר בערה ללג בעומר",
//         rating: 2
//     },
//     {
//         id: "4",
//         title: "כראמל 8 גברת בלום שולטת",
//         author: "מאירה ברנע גולדברג",
//         prevPrintedPrice: 84.00,
//         printedPrice: 67.20,
//         prevDigitalPrice: 42.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011374903-1698220042604439.jpg",
//         summary: "גברת בלום קרובה להיות השליטה היחידה על הטירה של ארתור ג’רום, על המפעלים ועל החתול המופלא כפי שתמיד רצתה – והשלטון כל כך הולם אותה! אלא שלפתע מופיעה בטירה גברת בלום נוספת – וגם היא מרושעת ושתלטנית... ספר חדש ומסעיר בסדרה האהובה שגרמה לאלפי ילדים להישאר ערים בלילה ולהתאהב מחדש בקריאה.",
//         review: "דור האלפא יקח אותנו לאבדון מה זה הספר פח אשפה הזה בעעע לאן הדרדרנו כחברה",
//         rating: 1
//     },
//     {
//         id: "5",
//         title: "כשהגלים מתחזקים",
//         author: "שרון צוהר",
//         prevPrintedPrice: 98.00,
//         printedPrice: 59.90,
//         prevDigitalPrice: 35.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011051081-1635697355480829.jpg",
//         summary: "מורן סתיו נלחמה במשך כל שירותה הצבאי עד שניתנה לה ההזדמנות להצטרף למסלול ההכשרה של הקומנדו הימי.\n\nגורמי הצבא ומשפחתה לא ממש תומכים בה, אבל היא נחושה להוכיח לכולם שאישה יכולה לצלוח את המסלול הצבאי הכי קשה שיש.\n\nהיחידה הזו התנהלה על טהרת הטסטוסטרון מאז ומעולם, והוא יעשה הכל כדי להוכיח למורן שאין כאן מקום לבחורות. המצב המורכב עומד להסתבך אפילו יותר ולהציב בפניהם עוד המון קשיים והתמודדויות.\n\nהכי חשוב להתמודד עם הכל בקור רוח ובמקצועיות – ביחידה הזו אין מקום לרגש....\n\n",
//         review: "אני לא חושב שיש מישהו שיהנה מהגיבוב שטויות האלה, קראתי מדריך לשימוש בטיפות עיניים שהיה יותר מותח",
//         rating: 1
//     },
//     {
//         id: "6",
//         title: "השקעות לעצלנים",
//         author: "תמיר מנדובסקי",
//         prevPrintedPrice: 89.00,
//         printedPrice: 71.20,
//         prevDigitalPrice: 32.00,
//         digitalPrice: 25.60,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011251352-164502225375980.jpg",
//         summary: "טיול מאורגן בג’ונגל הפיננסי שיפרוש בפניכם את עקרונות ההשקעה, אבל כזו שלא מצריכה ידע קודם או הבנה בכלכלה. הזדמנות מעולה להבין את פילוסופיית ההשקעה האחראית שסייעה לקוראים רבים ליהנות מרווחי החברות המצליחות בעולם.",
//         review: "ספר שאפשר לסכם את כולו במשפט אחד, והוא: פשוט שימו את הכסף בבורסה ותשכחו ממנו ל20 שנה, ועדיף שגם תשכחו מהספר הזה",
//         rating: 1
//     },
//     {
//         id: "7",
//         title: "הרגלים אטומיים",
//         author: "ג'יימס קליר",
//         prevPrintedPrice: 118.00,
//         printedPrice: 94.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 47.20,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013621301-1635788041597070.jpg",
//         summary: "איך נשבור הרגלים רעים ונטמיע הרגלים טובים? איך נתגבר על חוסר מוטיבציה וכוח רצון? איך נחזור למסלול לאחר שסטינו מהדרך? הנה הספר שיסייע לכם בכל אלו. כזה שמבוסס על מחקרים בביולוגיה, פסיכולוגיה ומדעי המוח, שמתאגדים לכדי מדריך קל ונגיש שיאפשר לכם להיפטר מכל מה שמשאיר אתכם מאחור ולעלות על השביל להצלחה.",
//         review: "ספר נצחי ברמה של חשוב והתעשר או כיצד תרכוש ידידים השפעה, לקרוא אותו שוב ושוב ולקנות אותו לעצמכם ביומולדת",
//         rating: 5
//     },
//     {
//         id: "8",
//         title: "חוכמת האדישות",
//         author: "מארק מנסון",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 49.90,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/012301743-1718708642862254.jpg",
//         summary: "ככל הנראה ספר העזרה העצמית הכי חתרני, חריג, מצחיק וייחודי שתקראו. כזה שלא דוחק בכם לאמץ ראיית עולם חיובית ומאושרת, אלא דווקא להעריך את המאבקים בחיים כי הם אלו שמעניקים להם משמעות, ומשמעות היא השאיפה האמיתית, הרבה יותר מאושר.\n\nעוף מוזר בתעשיית ספרי העזרה העצמית שהפך לרב מכר עצום שלגמרי שווה להתעכב עליו.\n\n",
//         review: "ספר מרתק שאומר דברים מרתקים על אנשים מרתקים וכתוב בצורה מרתקת על ידי סופר מרתק ",
//         rating: 4
//     },
//     {
//         id: "9",
//         title: "גריט",
//         author: "אנג'לה דאקוורת",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 42.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013621031-1635787656431825.jpg",
//         summary: "בגריט, שהגיע בן לילה לרשימת רבי המכר של הניו יורק טיימס, מראה הפסיכולוגית פורצת הדרך אנג’לה דאקוורת לכל מי ששואף להצליח – הורים, תלמידים, מחנכים, ספורטאים ואנשי עסקים או בעצם כל אחד – שהסוד מאחורי הצלחות יוצאות דופן אינו הכישרון שאנו ניחנים בו אלא שילוב מיוחד של להט והתמדה שאותו היא מכנה\n\nבגריט לוקחת פרופ’ דאקוורת את קוראיה לשטח ומפגישה אותם בין השאר עם צוערים הנאבקים לשרוד במסע המפרך שבו מתחילה הכשרתם באקדמיה האמריקאית לקצינים, עם מורים בבתי ספר קשים במיוחד ועם זוכי תחרות האיות הלאומית בארצות הברית. היא מצביעה על תובנות מרתקות מן ההיסטוריה, מראה מה ניתן ללמוד מניסויים מודרניים על התנאים שבהם מושגים ביצועי שיא, ומפרטת את מסקנותיה מראיונות שערכה עם עשרות אנשים שהגיעו להישגים יוצאי דופן \n\nהסיפורים האישיים והתובנות בספר זה אינם רק מרתקים אלא יכולים לשנות את חייהם של אנשים. גריט מגלה מדוע הצלחתנו תלויה במה שאנחנו חושבים כאשר אנו נכשלים",
//         review: "יש רגעים בחיים שחץ אחד מדויק פוגע במרכז מטרה וכשהמטרה הזו היא המטרה של חיינו אנו עומדים נפעמים",
//         rating: 5
//     },
//     {
//         id: "10",
//         title: "המוסד בטהרן",
//         author: "יהודה ניב",
//         prevPrintedPrice: 86.00,
//         printedPrice: 77.90,
//         prevDigitalPrice: 49.9,
//         digitalPrice: 34.50,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011325229-1710055912557069.jpg",
//         summary: "רעם הוא בחור אילם שמתעורר יום אחד לצד גופתה המדממת של בחורה שהוא מעולם לא ראה, במקום שהוא לא מכיר. הוא מגלה כי תשע שנים חלפו מחייו, אך הוא אינו זוכר דבר ממה שקרה בהן. כשהוא נרדף על ידי עבר אפל ומאיים, רעם האילם נמלט מהחוק ויוצא למסע הרפתקני, קצבי ומותח בעקבות האמת, בעקבות הזיכרון ובעקבות אהבת חייו.\n\nבספרו מספק יהודה ניב הצצה לעולמו של גיבור שנון ובוטה בעל הבנה עמוקה של העולם שמסביב. גישתו המקורית לחיים מעניקה לו דרך להתמודד עם מום שמונע ממנו לדבר אך לא מונע ממנו לחשוב.\n\nרעם אילם הוא פרויקט ייחודי, שבו משלב האמן יהודה ניב את כישרונותיו המגוונים ליצירה אחת. את הספר מלווה אלבום מוזיקלי המבוסס על פרקי הספר ומציג את הסיפור מנקודת מבטה של דמות אפלה המתגלה לאורך העלילה. בספר מופיעים ציורים שאף הם פרי יצירתו של המחבר.",
//         review: "יצירת מופת שתקח את הקורא למחוזות חדשים של אימה מתח וצחוק, מומלץ בכל פה",
//         rating: 5,
//     },
//     {
//         id: "11",
//         title: "אבא עשיר אבא עני",
//         author: "תומס אריקסון",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.90,
//         prevDigitalPrice: 44.9,
//         digitalPrice: 28.50,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013621380-1645612420742515.jpg",
//         summary: "פגישה עם איש עסקים זועם, שהיה בטוח שכל העובדים שלו אידיוטים, הביאה את חוקר ההתנהגות תומס אריקסון להשקיע שנים במחקר מאומץ, שבמהלכו התברר לו שבני האדם נחלקים לארבעה טיפוסי התנהגות עיקריים:\n\nמוקף באידיוטים מתאר את המאפיינים הבולטים של ארבעת הטיפוסים ואת הדרך הנכונה לתקשר איתם. הוא מסביר כיצד נוכל להתאים את עצמנו לכל טיפוס התנהגות ולהשפיע עליו (או להוציא אותו מדעתו), מספר על שיטות לשיפור שפת הגוף והתקשורת שלנו עם הבוס והעמיתים לעבודה, וגם מדגים איך תזהו מי אתם ותבינו טוב יותר את עצמכם.\n\nתומס אריקסון הוא חוקר התנהגות ומומחה לתקשורת שוודי. לצד עבודתו עם קבוצות מנהלים, והרצאות שהוא נושא בכל רחבי אירופה, פרסם אריקסון ספרים אחדים על תקשורת והתנהגות אנושית. ספרו מוקף באידיוטים תורגם ליותר מעשרים שפות ונמכר בקרוב לשני מיליון עותקים.",
//         review: "לתומס אריקסון יש דרך ייחודית לשחק לקורא במוח באופן שישאיר אותו פעור פה ומשתוקק לעוד",
//         rating: 4,
//     },
//     {
//         id: "12",
//         title: "כוחו של הרגע הזה",
//         author: "דון מיגל רואיס",
//         prevPrintedPrice: 74.00,
//         printedPrice: 59.20,
//         prevDigitalPrice: 39.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013371203-1635785859468897.jpg",
//         summary: "בחברה הצינית והתועלתנית שלנו כיום כמעט ואין מקום לרוחניות, למרות שכולנו זקוקים לה מאוד.\n\nרוחניות הפכה כמעט להיות כמעט מילה גסה מחוץ לחוגים מאוד מסויימים שלא מתאימים לכולם.\n\nאנחנו כמעט ולא עוסקים ברוחניות בחיי היומיום ובקושי דואגים להזין את הנפש הצמאה שלנו.\n\nדון מיגל רואיס, בן למשפחת מרפאים שמאניים שחווה חווייה חוץ גופית בעקבות תאונה, קורא לנו לאתגר את התפיסות שלנו לגבי העצמי שלנו, הנפש שלנו והקשר שלנו עם היקום המקיף אותנו. בספרו ”ארבע ההסכמות” הוא מנגיש עבורנו את חוכמתו העתיקה של הידע הטולטקי - אורח חיים המצטיין בזמינות גבוהה של אושר ואהבה.\n\nהוא מלמד אותנו על האמונות המגבילות, מהיכן הן נובעות, כיצד הן מייסרות אותנו ומשביתות את השמחה והיצירתיות שבנו, ומנחה אותנו כיצד לנטרל אותן.\n\nהספר פורש בספרו ארבע הסכמות שאנו צריכים שעלינו לעשות עם עצמנו על מנת להתחיל לחיות טוב יותר, לשפר את בריאותנו המנטלית והרוחנית וליצור לעצמנו יציבות בלב עולם סוער.\n\nהתובנות שלו עוסקות בכוחן של המילים, בשחרור מהתחושה שהכול קשור בנו ומלהניח הנחות, ולעשות תמיד את הכי טוב שרק נוכל.\n\nאומר דון מיגל רואיס, ובספר הזה הוא מעניק לנו את הכוח לחלום ומניח בידינו את המפתח להגשמה העצמית וההתפתחות הרוחנית שנזקקנו לה.",
//         review: "לא כל אחד יכול לכתוב יצירה כזאת ולא כל אחד יזכה במהלך חייו לקרוא טקסט כל כך מאלף, חובת קריאה",
//         rating: 5
//     },
//     {
//         id: "13",
//         title: "השראה יומית",
//         author: "שרון צוהר",
//         prevPrintedPrice: 98.00,
//         printedPrice: 59.90,
//         prevDigitalPrice: 35.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/010072181-1635689259295225.jpg",
//         summary: "לא חיפשתי את האביר על הסוס הלבן, לא חיפשתי את הגבר שישנה את כל עולמי. ריבאונד, זה כל מה שזה היה אמור להיות, מישהו שיעזור לי לשכוח, להתקדם הלאה. ואז פגשתי את אלמוג אלבז וכל התוכניות השתנו. חשבתי שאנחנו פועלים לפי חוקים מסוימים, ברורים מאוד, אבל נראה שאלמוג פועל לפי סט חוקים משלו.\n\nכמה אירוני זה לפגוש את אשת חלומותיך בחתונה, ללכת איתה הביתה ולגלות שזו אחותו הקטנה של החבר הכי טוב שלך?\n\nלילה אחד, זה היה הדיל. אף אחת מעולם לא קיבלה יותר מזה, עד שהיא הגיעה. עמדתי מהצד וראיתי את החברים שלי נופלים בזה אחר זה, הבטחתי לעצמי שלעולם לא אאפשר לזה לקרות גם לי, ואז רותי התרסקה לתוך החיים שלי כמו מטאור ואפילו לא ראיתי את זה בא.\n\nלהתאהב ולהישאר בחיים מאת סופרת רבי המכר שרון צוהר הוא סיפור נוסף בסדרת כשהגלים מתחזקים, סיפור אהבה מעולם הצבא ושייטת 13. הספרים שקדמו לו בסדרה: כשהגלים מתחזקים ודואט חמש אצבעות על היעד.",
//         review: "ספר בינוני ביותר, הייתי משאיר אותו על המדף, בעצם הייתי שם אותו כמעצור לדלת או אפילו משתמש בו כחומר בערה ללג בעומר",
//         rating: 2
//     },
//     {
//         id: "14",
//         title: "חשוב והתעשר",
//         author: "מאירה ברנע גולדברג",
//         prevPrintedPrice: 84.00,
//         printedPrice: 67.20,
//         prevDigitalPrice: 42.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/012302309-1635784148421335.jpg",
//         summary: "גברת בלום קרובה להיות השליטה היחידה על הטירה של ארתור ג’רום, על המפעלים ועל החתול המופלא כפי שתמיד רצתה – והשלטון כל כך הולם אותה! אלא שלפתע מופיעה בטירה גברת בלום נוספת – וגם היא מרושעת ושתלטנית... ספר חדש ומסעיר בסדרה האהובה שגרמה לאלפי ילדים להישאר ערים בלילה ולהתאהב מחדש בקריאה.",
//         review: "דור האלפא יקח אותנו לאבדון מה זה הספר פח אשפה הזה בעעע לאן הדרדרנו כחברה",
//         rating: 1
//     },
//     {
//         id: "15",
//         title: "לצאת מהמבוך",
//         author: "שרון צוהר",
//         prevPrintedPrice: 98.00,
//         printedPrice: 59.90,
//         prevDigitalPrice: 35.00,
//         digitalPrice: 28.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013621236-1635787937662921.jpg",
//         summary: "מורן סתיו נלחמה במשך כל שירותה הצבאי עד שניתנה לה ההזדמנות להצטרף למסלול ההכשרה של הקומנדו הימי.\n\nגורמי הצבא ומשפחתה לא ממש תומכים בה, אבל היא נחושה להוכיח לכולם שאישה יכולה לצלוח את המסלול הצבאי הכי קשה שיש.\n\nהיחידה הזו התנהלה על טהרת הטסטוסטרון מאז ומעולם, והוא יעשה הכל כדי להוכיח למורן שאין כאן מקום לבחורות. המצב המורכב עומד להסתבך אפילו יותר ולהציב בפניהם עוד המון קשיים והתמודדויות.\n\nהכי חשוב להתמודד עם הכל בקור רוח ובמקצועיות – ביחידה הזו אין מקום לרגש....\n\n",
//         review: "אני לא חושב שיש מישהו שיהנה מהגיבוב שטויות האלה, קראתי מדריך לשימוש בטיפות עיניים שהיה יותר מותח",
//         rating: 1
//     },
//     {
//         id: "16",
//         title: "המדריך למשקיע המתחיל",
//         author: "תמיר מנדובסקי",
//         prevPrintedPrice: 89.00,
//         printedPrice: 71.20,
//         prevDigitalPrice: 32.00,
//         digitalPrice: 25.60,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/013730121-1635788351429975.jpg",
//         summary: "טיול מאורגן בג’ונגל הפיננסי שיפרוש בפניכם את עקרונות ההשקעה, אבל כזו שלא מצריכה ידע קודם או הבנה בכלכלה. הזדמנות מעולה להבין את פילוסופיית ההשקעה האחראית שסייעה לקוראים רבים ליהנות מרווחי החברות המצליחות בעולם.",
//         review: "ספר שאפשר לסכם את כולו במשפט אחד, והוא: פשוט שימו את הכסף בבורסה ותשכחו ממנו ל20 שנה, ועדיף שגם תשכחו מהספר הזה",
//         rating: 1
//     },
//     {
//         id: "17",
//         title: "מועדון החמש בבוקר",
//         author: "ג'יימס קליר",
//         prevPrintedPrice: 118.00,
//         printedPrice: 94.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 47.20,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/010073808-1635691015315909.jpg",
//         summary: "איך נשבור הרגלים רעים ונטמיע הרגלים טובים? איך נתגבר על חוסר מוטיבציה וכוח רצון? איך נחזור למסלול לאחר שסטינו מהדרך? הנה הספר שיסייע לכם בכל אלו. כזה שמבוסס על מחקרים בביולוגיה, פסיכולוגיה ומדעי המוח, שמתאגדים לכדי מדריך קל ונגיש שיאפשר לכם להיפטר מכל מה שמשאיר אתכם מאחור ולעלות על השביל להצלחה.",
//         review: "ספר נצחי ברמה של חשוב והתעשר או כיצד תרכוש ידידים השפעה, לקרוא אותו שוב ושוב ולקנות אותו לעצמכם ביומולדת",
//         rating: 5
//     },
//     {
//         id: "18",
//         title: "להתחיל עם למה",
//         author: "מארק מנסון",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 49.90,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/011140802-1635700185350992.jpg",
//         summary: "ככל הנראה ספר העזרה העצמית הכי חתרני, חריג, מצחיק וייחודי שתקראו. כזה שלא דוחק בכם לאמץ ראיית עולם חיובית ומאושרת, אלא דווקא להעריך את המאבקים בחיים כי הם אלו שמעניקים להם משמעות, ומשמעות היא השאיפה האמיתית, הרבה יותר מאושר.\n\nעוף מוזר בתעשיית ספרי העזרה העצמית שהפך לרב מכר עצום שלגמרי שווה להתעכב עליו.\n\n",
//         review: "ספר מרתק שאומר דברים מרתקים על אנשים מרתקים וכתוב בצורה מרתקת על ידי סופר מרתק ",
//         rating: 4
//     },
//     {
//         id: "19",
//         title: "גריט",
//         author: "הנזיר שמכר את הפרארי שלו",
//         prevPrintedPrice: 98.00,
//         printedPrice: 78.40,
//         prevDigitalPrice: 59.00,
//         digitalPrice: 42.00,
//         imgPath: "https://www.steimatzky.co.il/pub/media/catalog/product/cache/054fd023ed4beb824f3143faa6fcc008/0/1/010071767-1635689135854766.jpg",
//         summary: "בגריט, שהגיע בן לילה לרשימת רבי המכר של הניו יורק טיימס, מראה הפסיכולוגית פורצת הדרך אנג’לה דאקוורת לכל מי ששואף להצליח – הורים, תלמידים, מחנכים, ספורטאים ואנשי עסקים או בעצם כל אחד – שהסוד מאחורי הצלחות יוצאות דופן אינו הכישרון שאנו ניחנים בו אלא שילוב מיוחד של להט והתמדה שאותו היא מכנה\n\nבגריט לוקחת פרופ’ דאקוורת את קוראיה לשטח ומפגישה אותם בין השאר עם צוערים הנאבקים לשרוד במסע המפרך שבו מתחילה הכשרתם באקדמיה האמריקאית לקצינים, עם מורים בבתי ספר קשים במיוחד ועם זוכי תחרות האיות הלאומית בארצות הברית. היא מצביעה על תובנות מרתקות מן ההיסטוריה, מראה מה ניתן ללמוד מניסויים מודרניים על התנאים שבהם מושגים ביצועי שיא, ומפרטת את מסקנותיה מראיונות שערכה עם עשרות אנשים שהגיעו להישגים יוצאי דופן \n\nהסיפורים האישיים והתובנות בספר זה אינם רק מרתקים אלא יכולים לשנות את חייהם של אנשים. גריט מגלה מדוע הצלחתנו תלויה במה שאנחנו חושבים כאשר אנו נכשלים",
//         review: "יש רגעים בחיים שחץ אחד מדויק פוגע במרכז מטרה וכשהמטרה הזו היא המטרה של חיינו אנו עומדים נפעמים",
//         rating: 5
//     },
// ];

